import random

# 不计世界任务掉落
# 例如雪山、九柱、层岩巨渊获得的宗室、千岩。
# 因为太少了

# 精英怪掉落的圣遗物
monster_artifact_name = [
      
    '战狂的蔷薇',
    '战狂的翎羽',
    '战狂的时计',
    '战狂的骨杯',
    '战狂的鬼面',

    '流放者之花',
    '流放者之羽',
    '流放者怀表',
    '流放者之杯',
    '流放者头冠',
    
    '教官的胸花',
    '教官的羽饰',
    '教官的怀表',
    '教官的茶杯',
    '教官的帽子',

    '冒险家之花',
    '冒险家尾羽',
    '冒险家怀表',
    '冒险家金杯',
    '冒险家头带',
    
    '幸运儿绿花',
    '幸运儿鹰羽',
    '幸运儿沙漏',
    '幸运儿之杯',
    '幸运儿银冠',
    
    '游医的银莲',
    '游医的枭羽',
    '游医的怀钟',
    '游医的药壶',
    '游医的方巾',

] 

# 调查点的一星和两星的狗粮
check_point_artifact_names = [
    '幸运儿绿花',
    '幸运儿鹰羽',
    '幸运儿沙漏',
    '幸运儿之杯',
    '幸运儿银冠',

    '游医的银莲',
    '游医的枭羽',
    '游医的怀钟',
    '游医的药壶',
    '游医的方巾',

    '冒险家之花',
    '冒险家尾羽',
    '冒险家怀表',
    '冒险家金杯',
    '冒险家头带',
]

# 宝箱掉落的圣遗物
treasure_artifact_names = [
    '幸运儿绿花',
    '幸运儿鹰羽',
    '幸运儿沙漏',
    '幸运儿之杯',
    '幸运儿银冠',

    '游医的银莲',
    '游医的枭羽',
    '游医的怀钟',
    '游医的药壶',
    '游医的方巾',

    '冒险家之花',
    '冒险家尾羽',
    '冒险家怀表',
    '冒险家金杯',
    '冒险家头带',

    '战狂的蔷薇',
    '战狂的翎羽',
    '战狂的时计',
    '战狂的骨杯',
    '战狂的鬼面',

    '教官的胸花',
    '教官的羽饰',
    '教官的怀表',
    '教官的茶杯',
    '教官的帽子',

    '流放者之花',
    '流放者之羽',
    '流放者怀表',
    '流放者之杯',
    '流放者头冠',

    # 行者套，存疑
    '故人之心',
    '归乡之羽',
    '逐光之石',
    '异国之盏',
    '感别之冠',

]


def random_monster_artifact_name():
    return random.choice(monster_artifact_name)

def random_check_point_artifact_name():
    return random.choice(check_point_artifact_names)

def random_treasure_artifact_name():
    return random.choice(treasure_artifact_names)